/**
 * Created by qinwy on 2016/12/19.
 */
var obj = {
    '200' : '接口成功',
    '401' : '没有权限',
    '404' : '未找到',
    '500' : '服务器错误',
    '5001' : 'token失效',
    '5002' : '参数错误',
    '5003' : '用户已存在',
    '5004' : '密码错误',
    '5005' : '账号未激活',
    '5006' : '账号不存在',
    '5007' : '账号被锁定',
    '5008' : '验证码错误',
    '5009' : '登陆密码错误次数过多',
    '5010' : '验证码超时',
    '5011' : '没有登陆',
    '5012' : '没有权限',
    '5013' : '不是合法的邮箱或手机号',
    '5014' : '填写的绑定邮箱错误',
    '5015' : '填入的绑定手机号错误',
    '5016' : '原密码错误',
    '5017' : '账号未激活',
    '5018' : '账号或密码为空',
    '5019' : '必填参数不能为空',
    '5020' : '操作失败',
    '5021' : '请求超时',
    '5022' : '登陆超时',
    '5023' : '接口签名不匹配',
    '5024' : '客户输入验证码为空'
}
function message(code){
    return obj[code]
}